CREATE DATABASE NotNormalized;
GO
USE NotNormalized;
GO

CREATE TABLE BankSystemBad (
    ID INT IDENTITY PRIMARY KEY,

    -- Данни за картодържател
    FullName NVARCHAR(100),
    EGN CHAR(10),
    Phone NVARCHAR(20),
    Email NVARCHAR(100),
    Address NVARCHAR(200),

    -- Данни за сметка (само една!)
    AccountIBAN VARCHAR(34),
    AccountBalance MONEY,
    AccountCurrency VARCHAR(5),

    -- Данни за карта (само една!)
    CardNumber VARCHAR(20),
    CardType VARCHAR(20),        -- Visa, MasterCard...
    CardExpire VARCHAR(10),
    CardAnnualFee MONEY,

    -- Данни за тип сметка
    AccountType VARCHAR(30),     -- Разплащателна, Спестовна...
    InterestRate DECIMAL(4,2),

    -- Данни за клон
    City NVARCHAR(50),
    BranchCode NVARCHAR(10)
);

INSERT INTO BankSystemBad
(FullName, EGN, Phone, Email, Address,
 AccountIBAN, AccountBalance, AccountCurrency,
 CardNumber, CardType, CardExpire, CardAnnualFee,
 AccountType, InterestRate,
 City, BranchCode)
VALUES
-- Иван Иванов – КАРТА 1
(N'Иван Иванов', '9901011234', '0888123456', 'ivan@abv.bg', N'София, ул. Шипка 10',
 'BG80BNBG96611020345678', 1200, 'BGN',
 '4111111111111111', 'Visa', '12/27', 30, N'Разплащателна', 0.00,
 N'София', '1001'),

-- Иван Иванов – КАРТА 2
(N'Иван Иванов', '9901011234', '0888123456', 'ivan@abv.bg', N'София, ул. Шипка 10',
 'BG80BNBG96611020345678', 1200, 'BGN',
 '5500005555555559', 'MasterCard', '05/28', 45,
 N'Разплащателна', 0.00,
 N'София', '1001'),

-- Мария Георгиева – КАРТА 1
(N'Мария Георгиева', '9812125678', '0899332211', 'maria@gmail.com', N'Пловдив, бул. Марица 5',
 'BG45UNCR70001520202020', 2500, 'BGN',
 '5105105105105100', 'MasterCard', '09/26', 40,
 N'Спестовна', 1.50,
 N'Пловдив', '2004'),

-- Мария Георгиева – КАРТА 2
(N'Мария Георгиева', '9812125678', '0899332211', 'maria@gmail.com', N'Пловдив, бул. Марица 5',
 'BG45UNCR70001520202020', 2500, 'BGN',
 '4000001234567899', 'Visa', '11/26', 35,
 N'Спестовна', 1.50,
 N'Пловдив', '2004'),

-- Петър Петров – КАРТА 1
(N'Петър Петров', '0101011111', '0889001100', 'petar@dir.bg', N'Варна, ул. Черно море 12',
 'BG66CECB97901234567890', 5400, 'EUR','6011000990139424', 'Discover', '03/27', 25, N'Разплащателна', 0.00,
 N'Варна', '3002'),

-- Петър Петров – КАРТА 2
(N'Петър Петров', '0101011111', '0889001100', 'petar@dir.bg', N'Варна, ул. Черно море 12',
 'BG66CECB97901234567890', 5400, 'EUR',
 '4200000000000000', 'VisaElectron', '12/25', 20,
 N'Разплащателна', 0.00,
 N'Варна', '3002'),

-- Галина Димитрова – 1 карта
(N'Галина Димитрова', '9703216543', '0887443322', 'galina@mail.bg', N'Бургас, ул. Сливница 1',
 'BG12STSA93000011112222', 890, 'BGN',
 '5301250000000012', 'Maestro', '02/28', 10,
 N'Разплащателна', 0.00,
 N'Бургас', '4001'),

-- Иво Стоянов – 1 карта
(N'Иво Стоянов', '9605129876', '0895111222', 'ivo@yahoo.com', N'Русе, ул. Дунав 20',
 'BG90UBBS88889999000011', 15000, 'USD',
 '378282246310005', 'AmericanExpress', '01/29', 120,
 N'Доларова', 0.00,
 N'Русе', '5003'),

-- Калин Николов – 1 карта
(N'Калин Николов', '8501012222', '0888001122', 'kalin@gmail.com', N'Плевен, ул. Победа 6',
 'BG77FINV91501333333333', 7200, 'EUR',
 '4000100022223333', 'Visa', '07/26', 30,
 N'Спестовна', 1.20,
 N'Плевен', '6002'),

-- Силвия Костова – 1 карта
(N'Силвия Костова', '9911223344', '0877009900', 'silvia@abv.bg', N'София, ул. Левски 44',
 'BG11BPBI12340000555555', 350, 'BGN',
 '6011000990139424', 'Discover', '03/27', 25,
 N'Разплащателна', 0.00,
 N'София', '1001');

 SELECT * FROM BankSystemBad

 